/* 와 대박 이제 끝났어!
이 강의를 들어줘서 고마워!
마지막 세션이 좀 끔찍했을 거 같아.
fetch가 뭔지.. 좀 이상하게 보이지.
그치만 JavaScript의 힘을 보여주고 싶었어.
완전 놀라워. 코드 20줄로 위치를 얻고 날씨를 알아냈어.
이건 진짜 대박이야.
여기서 끝이지만 JavaScript를 더 배우고 싶고 내 방식이 좋다면
JavaScript 풀스택을 하고 싶으면 wetube강의를 확인해 봐!
다음 단계의 JavaScript를 얻을 수 있는 곳이야.
보다시피, JavaScript는 브라우저에서 완전 강력해. 많은 것들을 해 봤지.
마찬가지로 백엔드에서 더 멋진 걸 할 수 있어.
데이터베이스를 만들 수 있구
비밀번호를 만들구 video를 저장하구 video format을 처리할 수 있어.
다운로드, 업로드도 할 수 있어.
모두 JavaScript에서! 놀랍지??
이제 작별할 시간이야.. 빠이빠이!
이건 보기 좋지 않지만 더 예쁘게 만들 수 있는 방법을 이미 알고 있어.
보다시피 내 버전은 이미 이렇게 있어.
우리가 배운 것과 똑같은 거구 이게 조금 다를 거야.
위치를 얻구.. 이 모든 걸 같이 했어.
알겠지?
좀 더 예쁘게 만든 것 뿐이야. 다른 건 없어.
알겠지?
이게 날짜.. 아니야 날씨야.
다른 건 완전 똑같아.
to do로 hello를 적구..
그리고 hello를 지울 수 있어.
이게 끝이야!
우리가 한 것과 똑같은데 좀 더 예쁠 뿐이야.
이제 CSS를 완전 다뤄 볼 시간이야.
끝나면 GitHub page로 너의 웹사이트를 보여줘.
알겠지? 왜냐면 네가 어떻게 만들었는지 완전 궁금해!!
이제 모든 걸 했어.
시계, 인사, to do 리스트, 랜덤 구문..
랜덤 배경 사진도 했어.
날씨도 하구.. 우리가 필요한 모든걸 했어!
이 강의를 들어줘서 고마워!
시간을 내서 집중해줘서 고맙구
이게 너의 멋진 JavaScript 여행의 첫번째면 좋겠어.
필요한 거나 질문은 comment로 남겨줘!
내가 알 수 있게!
wetube 강의에서 볼 수 있으면 좋겠어.
네가 좋아할 거라구 생각해.
이 강의처럼 2021년 버전으로 모두 재녹화했어.
이제 끝이야!
다음에 보자~
완전 건강 챙기구
행복하고 너의 새 JavaScript 재능을 즐기길 바라!
그리고 JavaScript challenge에 참여해줘!
다음에 봐!
바이바이~
 */